custom_models/flow_past_sphere_flat/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       205;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15;
        startFace       210;
    }
    front
    {
        type            patch;
        nFaces          125;
        startFace       225;
    }
    back
    {
        type            patch;
        nFaces          125;
        startFace       350;
    }
    sphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       475;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       485;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       490;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          45;
        startFace       490;
    }
)

// ************************************************************************* //
